[
  {
    "rating": 5,
    "review": "reaxing and enjoyable game. I've downloaded this before and have to download it again since my phone was changed. i immediately downloaded this wonderful game."
  },
  {
    "rating": 2,
    "review": "i cant click watch ad, why bother showing tons of free thing but must watch ad first if u cant even click it??"
  },
  {
    "rating": 5,
    "review": "One of my favorite games simple for the fact its penguins. its an idle game so you can play at your own pace. the graphic design is cute, i love it."
  },
  {
    "rating": 2,
    "review": "I want to restart but I always get sent to where I left off I uninstalled the game many times but still keep my progress will change after my data gets deleted"
  },
  {
    "rating": 2,
    "review": "i used to love this game, but now i don't even know why i keep it on my phone. there hasn't been a new real update since like 2? 3 years? that's such a pity, because it was so cute and cozy. I hope in the near future there will be new updates and just then I'll try to redownload this."
  },
  {
    "rating": 5,
    "review": "This game is nearly perfect relaxation for me, simple and adorable. I would be really grateful however if the screeching noise when inviting new penguins/leveling up spots was toned down please. It's really uncomfortable to listen to, especially with headphones, and it breaks the immersion"
  },
  {
    "rating": 5,
    "review": "I used to have an account with this game, I still remember reaching Z coins actually. But, I stopped after seeing a whale, I have a phobia when it comes to huge stuff. I'm enjoying it right now, it's peaceful. Back then, there were not a lot of features. Unlike today, you have a lot of offers I can't afford yet but I was hoping there's an anti ad."
  },
  {
    "rating": 1,
    "review": "What happened the research? I've been at tier 32 for almost 2 years now with no updates (just says more to come please wait), no new recipes, nothing new,. Guess developers have given up on this game. The game used to be a lot more fun. No way to advance even if you pay actual money, which I'm not going to do because they don't care to update the game."
  },
  {
    "rating": 2,
    "review": "visuals good but much more time consuming game means you don't have to stop just continuously work that's why no time to enjoy the scenery and music."
  },
  {
    "rating": 2,
    "review": "Good idea, except it lags so bad I can't even play the game at all its just a waste of a good idea. what a shame"
  },
  {
    "rating": 4,
    "review": "Love the game and have played for many years, but now, I'm often being redirected to Google Play Store by ads and then the game restarts and I lose the ad reward. It did make me wonder if you're doing this for extra ad revenue! However, the same is happening with other games (but not as often) so I suspect the issue is with one of your ad providers - please find out which one and tell them to stop!"
  },
  {
    "rating": 3,
    "review": "The game is good and relaxing, but the ads suck, you can't even close some of the ads, you gotta close the game and restart every time an adult plays"
  },
  {
    "rating": 1,
    "review": "this game has become almost unplayable due to ads constantly kicking you out of the game. fix this and I will continue playing and paying. otherwise I'll uninstall"
  },
  {
    "rating": 5,
    "review": "ILY PENGUIN ISLE FOR BEING ON LAPTOP AAAAA I'm sad I can't load my data from a few years ago but that's alright I was failing anyways heh"
  },
  {
    "rating": 5,
    "review": "Very Good Game. I remember playing this when I was 6 or 7, and I saw it on the app store and decided to give it a go again. I like the art style, which is quite simplistic. The only problem i have is if you weren't playing during the events, I don't think you can unlock the rewards such as special penguins after they're gone."
  },
  {
    "rating": 5,
    "review": "I love this game, absolutely my favourite game to play when I'm out and about. Super fun, awesome, cute penguins."
  },
  {
    "rating": 2,
    "review": "When I started playing this game a year or so ago the advertising was manageable and not overly intrusive. Recently returned to the game and the ads were so aggressive and repetitive I've uninstalled the game. Progress is tied to either watching ads or spending money, this game is worth neither the time or money for either option. Which is a shame because a couple of years ago this was a decent idle game."
  },
  {
    "rating": 4,
    "review": "I just realised I've been playing this app for nearly 5 years now. The cute penguins still amuse me! I've reached a pause awaiting new levels for the past 1-2 years or so? Feeling a bit glum that I can't push forward 😔"
  },
  {
    "rating": 2,
    "review": "they have gotten lazy with the monthly task things, the prizes are just to earn basic rewards instead of new recipes and costumes, penguins. disappointing since I've had this game for YEARS and spent money on it. they haven't even added a new minigame since the first and only mini game came out years ago."
  },
  {
    "rating": 1,
    "review": "i can't even create the first fishing spot, my game is bugged even when i reinstalled it. Frustrating to not being able to play it"
  },
  {
    "rating": 5,
    "review": "Honestly a good game for long term activity for people that love penguins this is the right game (took 20 pictures in 25 minutes)"
  },
  {
    "rating": 5,
    "review": "game is so cute and fun, developers were very helpful on helping restore my progress from a previous device 👍🐧"
  },
  {
    "rating": 1,
    "review": "Gets boring too quickly once you reach to a certain point (specifically when you're unlocking the roller coaster). The monthly pass skins are often plain and boring. There should also be a daily reward where Day 15 could be a unique item that you could get in the event chest because there is no way I'm paying so much money for a chance to get a simple bush. I have purchased the monthly passes since April, and I might spend it elsewhere if the rewards are still super plain"
  },
  {
    "rating": 5,
    "review": "I don't know how I am going to survive life without this therapeutic app. Please keep launching events, new features, and more new penguin designs to come. I love my babies so much 😔❤️"
  },
  {
    "rating": 5,
    "review": "It's so calm and relaxing. I love how easy it is to upgrade things and how there isn't really a limit to how many penguins you can have."
  },
  {
    "rating": 5,
    "review": "I'm so in love with the game plz make a game like islanders pls habbbby am begging 🫡🫡🫡 already I rated it five stars"
  },
  {
    "rating": 5,
    "review": "this game is very good and fun an is very good when you got back from home from a long day 10000/10 this game is good"
  },
  {
    "rating": 2,
    "review": "had been playing for a month on Android 14 without any problem but after updating to android 15 i couldn't claim any video rewards cause the video keeps repeating and the exit ❌ doesn't appear so until this is fixed it's nearly impossible to continue further"
  },
  {
    "rating": 3,
    "review": "I cleared the cache and data and re installed the game, and it still does not allow me to complete the first upgrade on the very first penguin."
  },
  {
    "rating": 5,
    "review": "I've played this game for a while, but a few years back I switched from iphone to android and I didn't see a way to transfer my data over. I don't know how or why I looked into it again, but I read someone had messaged their tech support on facebook and were able to transfer their account. I tried it, thinking it was a long shot, but they were super informative and were able to transfer my data! I'm so glad I can play again! Def one of my favorite games and highly recommend to anyone!"
  },
  {
    "rating": 5,
    "review": "it is so chill and cozy, gives such a wonderful vibe anytime I play 10/10 and if you'll excuse me I'll be off to build my PENGUIN EMPIRE!"
  },
  {
    "rating": 4,
    "review": "it's a great calm game but for some reason after switching and upgrading my phone my fps on this game is awful and unplayable"
  },
  {
    "rating": 1,
    "review": "been playing for an hour. totally overwhelmed by the type of premium currencies. UI has too many dark patterns (accidentally clicked watch ad to rush something not even sure what). looked cute, great music, if this were Buy2Play would have given them my money. earlier 3-star rating comment: okayish so far. always hard to tell in first day I don't know why Rate Me gets asked so early. And I especially hate reading everyone else's first impressions. tells me nothing."
  },
  {
    "rating": 4,
    "review": "firstly I love this game, I've been playing for years. my 2 gripes are that the font is really light and hard to see and that you have to get rid of decorations to build more decorations. there's very little to do the further into the game you get as well. spare a thought for us long term players lol"
  },
  {
    "rating": 4,
    "review": "I really like it, but there is this pointy icon constantly on the screen and I'm not sure how to get rid of it. I've been through the settings and I just can't work it out. Help please?"
  },
  {
    "rating": 1,
    "review": "i lost my previous ID,unfortunately there's no effective way to get my due account back,which base is already well-developed,and i need to rebulit again from nothing with a new account."
  },
  {
    "rating": 1,
    "review": "volví a descargar el juego, y se me perdió todo el progreso de añosss que tenía. todo por la nueva actualización de la cuenta en la nube. Realmente me sentí muy mal que juego mucho este juego cuando me quiero distraer y ahora sin el progreso que antes tenía ya no es divertido."
  },
  {
    "rating": 2,
    "review": "We can feel the money grabs starting to plague the penguins. The ads have gotten rough, advancing without paying $ takes HUGE amounts of investment now instead of a gradual growth as you play. You could get to AZ gold relatively quickly with casual play before, now even getting to AB can take forever. There are better lofi games, but they don't focus on penguins like this one does."
  },
  {
    "rating": 3,
    "review": "I really like this game, is so relaxing and the penguin are soso cute. I even convinced my friend to download it and now she is obsessed too. Edit: now you can add your friends/neighbours I AM IN LOVE Edit 2025: that's sad that they stopped adding new habitats, it feels like the game stopped"
  },
  {
    "rating": 3,
    "review": "Just updated and can't even play the game. Screen is three different colors. I've deleted and re-download three tines"
  },
  {
    "rating": 3,
    "review": "Pls fix the bug when I open the game my screen was tern into black, the game was process but the problem I can't see the game because its tern in whole black"
  },
  {
    "rating": 3,
    "review": "This is soo fun and relaxing but i lost all my progress it was running fine till yesterday but when i opened it today i am back to square one i lost all my progress 😞"
  },
  {
    "rating": 4,
    "review": "This game is super cute and I thoroughly enjoy it. Only have a couple things: for the lightning bolts, can we get the number we actually need for progress? It says I need 3, but actually need 9. That's frustrating. Also, the monthly ad payment. That's A LOT to pay for a month. Why is it so expensive? Anyways, love the game, just needs a couple tweaks, and I wish the monthly ticket thing was cheaper."
  },
  {
    "rating": 4,
    "review": "Very cute and relaxing, but some things don't make sense. Higher tier habitat generates less gold but costs more to upgrade. I've reached the end of the game. I just wish the devs will expand it further or introduce something new, like new monthly mini games, for now there's only Jump! Jump!"
  },
  {
    "rating": 3,
    "review": "Don't play unless you just love penguins. I would not start this game now. This game HAD fabulous content, but not anymore. My First Sim game ever... 🐧😍, dropped to ⭐⭐⭐ because the events now are so poor. Nothing new is added except 🐧. Can't get old content anymore without $$ from a lottery so don't know if get what you even want. I lost access to the game due to my own fault. I started over. I had $$ in before. I've spent $$ this time. We want NEW Stuff."
  },
  {
    "rating": 3,
    "review": "I absolutely loved this game and it is surely a recommender BUT one time when i went to the app all of my progess all of my pinguins ,of my ice was gone and i was back to my one pinguin i was very upset🥲 all of my pinguins gone. I loved this game, but i never recovered of that and so i deleted the app. I don't know why my work got erased. So please check why that happened so others don't have to go through that heartache"
  },
  {
    "rating": 1,
    "review": "013125:Just returned to game after 3yrs hoping issues had been resolved; sorry to say they havent.I messaged the Devs req'g assistance.Not only did they not help, apparently they didnt read my email either. WHAT IS GOING ON WITH HABBY GAMES!😭 😭😭 A favorite game worthless: unplayable!!😭😭😭 123022: 3 stars for Dev reply TYVM!Problem still exists.122422:NO WAY TO PLAY THE GAME BC OF THE ADS.UNABLE TO MAKE ANY GAME PROGRESS AT ALL;MISSING OUT ON ALL THE EVENTS.Game went from a 10+star to a -10."
  },
  {
    "rating": 3,
    "review": "I love the game, super cute especially for penguin lovers, can get addicting just one problem. Everytime i watch a ad it crashes or the fake \"x\" takes me off the game one sec and the game restarts soon as i go back so i gotta watch it about 4 times before i get my reward. I did that again and than it CRASHED right before my reward so it registered that i did the ship for a mission but i never got my reward in the end. Please fix this issue since it's getting worser."
  },
  {
    "rating": 2,
    "review": "Used to be a nice little distraction but there hasn't been any significant upgrades for a long time. Just cash grab promotions that earn yiu things you don't need without upgrades."
  },
  {
    "rating": 2,
    "review": "I used to play and liked it a lot and had my progress saved on my Google play games account (I think, I had it saved in some way) but when I downloaded on my new phone after having to get a new one I had lost a lot of my progress. I still had some stuff but many of the things I had bought with real money like exclusive/special penguins and creatures were missing. Sent support/habby an email about this and they never responded so I deleted the game and never played again. disappointed"
  },
  {
    "rating": 4,
    "review": "really great and cute game. it flows very well and no intrusive ads! one downside though. when you watch ads for the treasure ship some of them force you to the playstore which crashes the game and you don't get your reward. ads that crash the game: foodventure,"
  },
  {
    "rating": 3,
    "review": "Fun little cute game. But the idle time is limited to 2 hours. It's hardly an idle game if I have to check on it 8 times a day."
  },
  {
    "rating": 4,
    "review": "I mean aside from the ads (which is normal!) It's really well made. Good aesthetic, and it is a very calm and relaxing game. If you like games like this, I recommend *Cats & Soup* or *Alto's adventure*"
  },
  {
    "rating": 1,
    "review": "I love this game, its simple and very adorable. However I am having issues with it, after unlocking the Hot Springs area, a hand pops up to tell me to tap. I tap everywhere and it just won't go away. Ive closed the app, opened it back up and its still there. I even uninstalled the whole game, reinstalled and restarted from the beginning, but after unlocking the same area it did the same thing. Its annoying its hovering in the middle of my screen no matter what I do or where I go. PLEASE FIX THIS"
  },
  {
    "rating": 2,
    "review": "The new update isn't showing up in-game. I've updated it, but I'm not seeing anything about flight attendants and pilots."
  },
  {
    "rating": 2,
    "review": "Game restarts and in the tutorial I paid the first habitat and it reset and I did not get my gold back"
  },
  {
    "rating": 2,
    "review": "The devs stopped trying with this game. There're no more new limited decorations in the updates, except for annual anniversaries. They even locked all the old ones under a lottery-like paywall. So, you can either collect free tickets for half a year to get 1 unique item or spend a lot of money. If you're a long-time player, there's nothing for you to do in the game anymore. And if you're new, you won't get the nice stuff others have. I don't think they will ever create a new location either."
  },
  {
    "rating": 4,
    "review": "I enjoyed this game overall. The graphics are cute, the gameplay is relaxing, and there are lots of things to do in the game. My only complaint is that if you don't play the game for a while, you get a dramatic letter from the penguins which guilts you into playing the game more. This was stressful and it was the main reason I uninstalled the game. There are some adds, but they aren't bad. Overall I liked the game."
  },
  {
    "rating": 1,
    "review": "I'm having plenty of fun with the game, but crashes. Needs update to fix this problem. Unstable. Game erased."
  },
  {
    "rating": 1,
    "review": "Played this game for two months and there is nothing relaxing about it. This game is nothing but watching the screen waiting for ads to watch. You cannot progress through the game without watching ads as they are an integral part of your islands advancement. The only part of this game I enjoyed was uninstalling it."
  },
  {
    "rating": 3,
    "review": "Finally I'm back and pick up where i left off. Thanks for helping me though, it takes 2 years before they fixed it. But, im glad that i got my progress back."
  },
  {
    "rating": 1,
    "review": "Gameplay consists of watching an increasing number of advertisements to progress as the quests for research points get more difficult. Not really fun to me..."
  },
  {
    "rating": 1,
    "review": "Installs without permission. Malware. I don't care what excuse you make. Your game installed immediately upon reboot after an android security update. It is malware and you are scum. I don't play games on my phone. I do no not want or game and didn't accidentally click on anything. I watched it install and know what happened."
  },
  {
    "rating": 4,
    "review": "The game is great and watching them having fun around. The special even penguins are really adorable. I just installed it because of the food themed penguins. Hoping there's a chance you can get the previous ones."
  },
  {
    "rating": 1,
    "review": "I like this game, but most of the functions work when you watch ads, but my button to view ads is not active, so it became very difficult to play, when I tried to contact support about this problem, I did not receive an answer. Clear cache, reinstall game, check ad settings, none of this helped"
  },
  {
    "rating": 4,
    "review": "To start, I love this game. I don't mind how ads are used; I can opt in or out. I'm happy to click ads to support developers when they're not forced on me. However, I've been getting incredibly frustrated by the types of ads. They're multilayer, requiring up to three clicks in different places, with 5-30 second delays before I am allowed to continue to the next \"phase\" of the ad. It's really frustrating that the ad structure makes me not want to play the actual game, which I do enjoy."
  },
  {
    "rating": 2,
    "review": "The 5th anniversary event is supposed to end today at 09:00, why you deleted it before time? Making me lose the rewards I was saving for buying staff... So irresponsible."
  },
  {
    "rating": 1,
    "review": "I don't know how to get seagull nest and I don't like how long it take to get decorations for my Isla and I don't like that it takes forever to expand my Isla."
  },
  {
    "rating": 4,
    "review": "Really cute. The game is pretty simple to follow and I like it. Unfortunately, since I've had the app for quite a awhile, there are no more habitat expansions for me to work towards! Please add some new habitats so I can keep playing! They also haven't added any new outfits or recipes in a LONG time. They used to add them a lot, but not any more. It would be nice to get some even occasionally..."
  },
  {
    "rating": 3,
    "review": "Really good game and I'm enjoying playing it. There are a ton of little details in this game which shows they pay attention. HOWEVER I'm getting really tired of the ads. This game essentially forces you to use the ship and the gift features to progress quickly. These are super aggressive 60 second ads. Really breaks up the gameplay and gets in the way. Would I pay for the ad free? Absolutely if it wasn't 30 a MONTH! For a phone game! There are so many subscriptions that offer more for less."
  },
  {
    "rating": 4,
    "review": "I really like to play this game. This is fun but it usually force close in the loading screen. I dont know is this because my device doesn't work properly or the app not support. Maybe you can figure it out and tell the solution. Thank you"
  },
  {
    "rating": 4,
    "review": "Good game but so many bugs One of that is : when i play this game , i took a picture with the pic feature then later then , its a mission but i cant get the mission done"
  },
  {
    "rating": 3,
    "review": "I love this game but it's been crashing everytime i try to open the app. I just tap on it, turns to black and then crashes. I can't even get to the loading screen. I just hope i still have my progress on there :( this has been happening for a couple of months, but haven't said anything until now, 'cause if the game is broken, you don't really think about it"
  },
  {
    "rating": 3,
    "review": "I have 19/24 achievements unlocked for this game but I downoad it again and everything is gone? It doesn't work that way. No games that I've put on rest has ever deleted my data.."
  },
  {
    "rating": 3,
    "review": "I lost 4 thousands gems cause of bug when you leave the app in phone cache and crafting is complete. It just shows crazy amount to pay for crafting competion in that case. Usually I just close the app and after reentering I can gather crafted item for free. But this time I was sleepy and accidentally paid 4k gems for completed free crafting item. Game is good, but loosing half of your gems for nothing seems unfair."
  }
]