[
  {
    "rating": 1,
    "review": "2025 not belong to top 10 palystore (1) always nagging to upgrade to premium. (*) verdict uninstall for good"
  },
  {
    "rating": 3,
    "review": "good for SCHOOL if you have a cool teacher that lets u use ur phones for cahoots (I still prefer blooket)"
  },
  {
    "rating": 5,
    "review": "haven't played it a while but I like the fact you can make your own quizzes it's pretty nice but I don't know why this app pops up when I suddenly search up blooket"
  },
  {
    "rating": 4,
    "review": "nice for kids and friends if you read do not get addicted because it bad for your brain but people do steal a brain rot if you don't know what that is it's on Roblox and it's addicting and it's bad for your brain so don't do it do animals or stuff like that"
  },
  {
    "rating": 3,
    "review": "okay, I love it but the problem is that there are kids making funny names and that makes the teacher mad and angry and students often likes making the teacher mad and some of the students don't like making the teacher mad and also I learned a lot about Kahoot it's a really fun game/quizzes and entertaining for children I say it's really fun making it a game for children and giving them new challenges every day"
  },
  {
    "rating": 5,
    "review": "Grate app! one of my favorites on my phone! It's really fun to play with friends and family! I highly recommend it."
  },
  {
    "rating": 3,
    "review": "Great app itself, especially when I want to play dumb stuff like \"Guess who\" with my friends at sleepovers, BUT WHY DOES EVERYTHING COST MONEY NOWADAYS?? im genuinely sick of trying to do something fun with my questions, then being presented with \"kahoot premium\" or whatever. this app is so money hungry.. no wonder all of my teachers use blooket now. more fun and nearly all free smh.. also, \"reaching out to your team\" does nothing. so pls don't respond if that's what ur gonna say, to be honest.."
  },
  {
    "rating": 2,
    "review": "This app was one of the laggiest I’ve ever used. The website on my PC works just fine, but the Android version is a mess. It keeps crashing and freezing up. I’ve tried updating it, clearing the cache, and even reinstalling it, but nothing seems to help. Such a frustrating experience!"
  },
  {
    "rating": 5,
    "review": "A professor uses this to playfully test knowledge at the end of class. Much like Jackbox games. I love it!"
  },
  {
    "rating": 1,
    "review": "for some reason i can't enter my gallery, ive tried multiple things to enter it but just couldn't. And also the premium feature, its just pisses me off even more."
  },
  {
    "rating": 5,
    "review": "I can do so much on here, even without any sort of membership or playing any games with other people the app is still outstanding."
  },
  {
    "rating": 1,
    "review": "Everything is premium now 💀 how come i'm making a kahoot trying to make interesting and I can only choose multiple answers (just 4 though) and true or false I hate this."
  },
  {
    "rating": 3,
    "review": "I wish it would read the questions and answers out. If it would do that, then I would give it a hard 5 starts."
  },
  {
    "rating": 1,
    "review": "Trash app i was coming first in my school quiz and then it disconnected. Very bad experience. Worst app ever. Trashhhhhhh"
  },
  {
    "rating": 5,
    "review": "Wynn wong Edit history is public unless you delete the review. Learn Rate this app Kahoot! Play & Cr...."
  },
  {
    "rating": 1,
    "review": "this is the worst app i've ever came across, how is the player suppouse to know how to play the \"game\" without an guide on what to do.???"
  },
  {
    "rating": 5,
    "review": "I'm a student, and many teachers in my school have used this application to gamify my studies! It uses a point system, whereby I get the most points when answering quickly yet accurately. This not allows me to have fun while learning, it also allows me to recall concepts learnt in school better."
  },
  {
    "rating": 4,
    "review": "এম এ জলিল অনন্ত জলিল ভাই এর সাথে একমত হতে পারলাম না বলে অভিযোগ উঠেছে তৃণমূলের জেলা সভাপতি তথা রাজ্যের মন্ত্রী"
  },
  {
    "rating": 4,
    "review": "Great app for when your bored or need help with something, youll almost always find something for your fandom or school."
  },
  {
    "rating": 2,
    "review": "Terrible app. Very hard to navigate. The tabs on the bottom are just decoration. I can't get to anything else in the app, like my \"favourites\"."
  },
  {
    "rating": 1,
    "review": "it was fun until money started leaving my PayPal without making any sense 😒 the take every 3 days 27 or 21 euros. it was supposed to be once a month, not every 3 days. in a whole month I lost lots of money. stealing with tricks. never again."
  },
  {
    "rating": 2,
    "review": "Keep looking for a perfect option before committing to this one. It throws in the kitchen sink and charges way too much for all the bloat. I subscribed to see what it was all about, tried a couple surveys, and canceled after seeing that it was a bit overwhelming to just do the simple task I was interested in, especially for the cost. I thought I was just in a trial, but evidently not. The developer and Google Play both point fingers at each other for help, unfortunately. I hope this helps you."
  },
  {
    "rating": 1,
    "review": "Please, I am calling on Kahoot developer to refund my money of N42,000 back to me. I downloaded this app just yesterday, 21st of July, 2025. And I was offered 7 days free trial before the deduction of payment. But instead, my money was deducted that same yesterday I downloaded the app. Who does that? That's fraudulent ooooo, I am calling on Kahoot to refund my money with immediate effect. Please, the same route you took in collecting the money, also use that same route in returning the money."
  },
  {
    "rating": 5,
    "review": "I love this app, it really contributes towards my learning and I am able to memorise my notes because of the flash cards that I use, I am really happy about it"
  },
  {
    "rating": 1,
    "review": "continuous connection drops, questions not visible on each Device. takes infinite time to load the quiz. no point in paying"
  },
  {
    "rating": 5,
    "review": "it is so fun for me and my mates at home and at school I love playing it because we don't do any work like today we played a kahoot and we all enjoyed it so much I HIGHLY RECOMMEND GETTING."
  },
  {
    "rating": 5,
    "review": "All throughout elementary school all my teachers would make up play kahoots. theyre so freaking awesome. i still wish that my teachers now would use it. GOATED learning service. My classmates would always yell at each other when someone got an answer wrong. anyways yeah. highly recommend because everyone loves kahoot. kahoot will always hold a special place in my heart not just because i actually passed tests thanks to it but also the memories of quizzing my friends on the dumbest things with it"
  },
  {
    "rating": 3,
    "review": "Schade, dass viele Funktionen nur für Premiumnutzer verfügbar sind. Trotzdem kann man schöne Rätsel erstellen und Spaß daran haben."
  },
  {
    "rating": 5,
    "review": "I love it. Great app! keep up the work it is really the best quiz game/app. that's why I rate it 5 stars. It's playable as well. alhamdulilah/thanks for making this quiz app!"
  },
  {
    "rating": 1,
    "review": "i didn't use any premium features but yet it keep asking me for a premium subscription and won't let me save my work"
  },
  {
    "rating": 5,
    "review": "my daughter showed this app and now it's as if we have added another board game to our collection. Stratego still is our favorite board game"
  },
  {
    "rating": 5,
    "review": "it is so helpful app for everyone like office friend's and school classroom and a simple man and best teacher"
  },
  {
    "rating": 1,
    "review": "hate this app. i spent a ton of time on making a kahoot and when i clicked host live it was just loading for like 3 minutes and nothing happened. it also asks me to update the app even though its definitely updated. and yes,i have internet"
  },
  {
    "rating": 1,
    "review": "I gave it a store because it keeps logging me out so trust me don't play this game it is a game and can you please like And subscribe to B drizzle"
  },
  {
    "rating": 1,
    "review": "I do pretty well in French class, but I sometimes rank low in Kahoot. I really don't like a game telling me that I'm a bad student. My assessment shouldn't be reduced to how quickly I can click an answer. Kahoot is a very discouraging game. Please stop telling me that I'm a bad student just because I'm not always the fastest at clicking."
  },
  {
    "rating": 1,
    "review": "worst app this thing steals your personal details and after a few years it steals all of your bank money why will a person make a educational app that is good and bad i hope this has so many helpful☹️"
  },
  {
    "rating": 1,
    "review": "it is like such a waste app that if the network also work properly but it tells there is no network see I should give it 0 review 😡😡😡😡😡📈 it should improve a lot"
  },
  {
    "rating": 1,
    "review": "horror, my daughter worked two days with a Kahoot and it's impossible to share with anybody. There is no information or warning about it.. terrible UX only deep in the documentation that yes it's not possible."
  },
  {
    "rating": 4,
    "review": "I played this game at 2023 or 2024 and here's my experience: I really liked the app actually.I can create questions for my friends or relatives to challenge them but there's a problem it lags out sometimes."
  },
  {
    "rating": 4,
    "review": "amazing but could use a bit of an improvent for example blooket they have a minigame before the game start so i want kahoot to try do a mini waiting game for it to start"
  },
  {
    "rating": 3,
    "review": "It's difficult to obtain results. The most important thing for me is the overall feedback on how students play my games, as I would like to use it to inform improvements. Secondly, we cannot play the game as quickly as possible because every task cannot be skipped with a button — there is no button to skip them (they last 5 or 10 seconds and we can't turn them off)!"
  },
  {
    "rating": 4,
    "review": "Cool app and it helps me to get smarter but when i play the game hello kitty and friends it doesn't let me choose an avatar so 4 stars 🌟 bye bye. 😍"
  },
  {
    "rating": 5,
    "review": "it's nice game guys just download it it's nice app ... I have been using this app for long time and I have never seen a problem with this app.. .... . my name is pop Francis"
  },
  {
    "rating": 5,
    "review": "kahoot is the best!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
  },
  {
    "rating": 2,
    "review": "Greed over quality Remember when features like multi-choice answer came with the app, and you didn't need to buy the DLC of sorts? The free user is constrained to buy things fundamental to the functioning of the app."
  },
  {
    "rating": 5,
    "review": "They intentionally added pauses to stall us. We're just trying to do the quizzes. 🤷‍♂️ No need for pauses."
  },
  {
    "rating": 3,
    "review": "Honestly really good! It's so fun, but for some reason the videos don't work all the time. Otherwise it's really great! Love playing it with my friends and school mates!"
  },
  {
    "rating": 3,
    "review": "The ranking system is awful. You can be in the first place, and when you make one tiny mistake, you end up in the last place. The same goes if you answer a 0.1 second late, then your opponent. I'm very disappointed about the gameplay. It's unfair and creates a butt ton of tension, which ruins the atmosphere."
  },
  {
    "rating": 4,
    "review": "It's super good like about everything good and smooth but the bad thing is that you can just use a website and not use a lot of storage but if it was not on website then it will be 5 stars"
  },
  {
    "rating": 2,
    "review": "I'm playing on a Samsung s24 and I can't see the questions and I don't know what the answers mean because there's no words on them"
  },
  {
    "rating": 4,
    "review": "it's very cool back in primary school especially in yr 5 we used to do Kahoot at the end of term i remember doing a 5 yr out of date one about queen Elizabeth II anniversary for being the queen for over 70s rip 🙏 🪦 🕊 it was the best day everyone enjoyed it u can put silly names it's quite expensive I mean I don't have premium on kahoot but the only thing u need is the app & possibly Gmail for more features u can play solo with ai CPU ppl or with friends with the pass u can also watch ytb"
  },
  {
    "rating": 3,
    "review": "I'll start with the positive and move onto the negatives . fun and addictive . no ads . I love creating . leaning now I'm on the negatives . when I finish my pass my whole progress is ruined . . when I create my kahhot most categories are premium required and I don't have premium and I think is a scam , you have to make puzzle , poll and slider become free . kind regards kahoot!"
  },
  {
    "rating": 3,
    "review": "It doesn't have a public button for me to change, so it's hard for my classmates to play my kahoot.(IOS users are ok but not the android users, and it literally annoyed me for some reason.) That's all for my complaint."
  },
  {
    "rating": 3,
    "review": "Great app but recently it's difficult logging in to my accounts. In fact I can't log in both on my app and on the web. What's going on?"
  },
  {
    "rating": 2,
    "review": "Sometimes freezes on a question and reloading doesn't help. Only quitting and joining back works. This happens even though I have a stable internet connection."
  },
  {
    "rating": 2,
    "review": "I keep on trying to log in to my other account to my other account, but it doesn't work, and when it does work, it's says I should link account but then when I put down the password, it doesn't work and tells me that MY password is wrong, they really should fix that."
  },
  {
    "rating": 2,
    "review": "It's ok at best, but what really pisses me off is the login or more specifically, the account link, it's says I should put the password down to link, I do that and then it tells me that my password is wrong when it's not, and for the login, even when I get everything right to a fault, it's still says that I got something wrong when I didn't, they should fix that problem or they're gonna annoy alot of people"
  },
  {
    "rating": 2,
    "review": "good but way les options unless you have premium. my mother is a teacher and she has tried this also should have a tutorial to use! good although!"
  },
  {
    "rating": 4,
    "review": "Good app, just remember to read the broadcast for the questions on the bigger screen and then answer the questions on the app."
  },
  {
    "rating": 3,
    "review": "I love the game and the ability to create them without having to pay, but some of the gifs and other are EXTREMELY inappropriate. Please remove those."
  },
  {
    "rating": 4,
    "review": "Good so far. I like the instant feedback on answers, but somebody really needs to go through everything for many spelling and grammar errors. It implement a automatic spelling and grammar check before posting. While it may seem inconsequential, it does present a lack of professionalism and quality."
  },
  {
    "rating": 4,
    "review": "Okay, so I am back again. good app but. unfortunately I had a issue, The discover page gets stuck on the same page! I couldn't change the background style because it was giving me a error! This app may need a update. but it's good."
  },
  {
    "rating": 4,
    "review": "The app is great but I want you to add randomize question feature when a person host, solo, practice, etc.. Instead of the same question in order."
  },
  {
    "rating": 3,
    "review": "I guess it's alright. The appeal is obvious, but in my opinion if you look past the flashy decor it's just a quiz. Nothing more, nothing less. If they added some new modes, similar to the blookit website, that might bring me back to this app. Deleting for now. 3 stars for functionality."
  },
  {
    "rating": 4,
    "review": "It really helps me learn and it's fun when you have friends to play with even better when you're competitive with each other"
  },
  {
    "rating": 3,
    "review": "Glitches on certain questions. options did not come up but when you tap the screen it chooses what was where you tapped."
  },
  {
    "rating": 2,
    "review": "I can't log in. I can't sign in. I can't delete parent mode. Every time I get rewards I can't take them because of error."
  },
  {
    "rating": 3,
    "review": "second placer kami sa uyag kaya 3/5 lang.. but over all it's a good interactive game HIGHLY recommend 🔥"
  },
  {
    "rating": 4,
    "review": "The Kahoot! app is an engaging platform for learning, teaching, and having fun through interactive quizzes and games. It is widely used by educators, students, and even professionals for team-building exercises and educational purposes"
  },
  {
    "rating": 4,
    "review": "Kahoot is amazing! We use it for quizzes and games, and it's always a hit! Easy to create, fun to play, and great for learning. Highly recommended app."
  },
  {
    "rating": 2,
    "review": "Somehow, you've managed to break the navigation bar at the bottom of the screen: none of the buttons except for the join button actually work! It's been broken for a good few patches now and I just... don't understand how it'd manage to break in the first place? Edit: It's still broken 7 months later. I have contacted support so I'm waiting patiently for fixes in the future"
  },
  {
    "rating": 2,
    "review": "I've been having problems lately, every time i do a test it takes out of it. Even closing the app completely. I think there's a bug"
  },
  {
    "rating": 2,
    "review": "I only have on problem when I make a kahoot it 90% time ask me to pick one of two of the same save of my kahoot from months ago to replace my save with and if u pick one it adds that save onto my current kahoot with my current save merging the two together which cause there to be 200 questions instead of the 100 I want then I must pain stackenly delete the 100 extra questions which were no suppose to be there one by one it's a hassle and a big pain. (fix for higher rating)"
  },
  {
    "rating": 2,
    "review": "I keep getting kicked out of a game every time I play. Sucks because sometimes I'm winning so do sth about it! Its not normal that after 2 question the app chooses to kick me out and if I ever get back with the code, my \"old me\" is still there but I can't access it. And that all started after creating a account"
  },
  {
    "rating": 2,
    "review": "Not so bad, but the thing is when I want to put an image in my quizzes, it kicks me out of the app. I don't know why but can you fix this somehow?"
  }
]