[
  {
    "rating": 5,
    "review": "best app for science and mathematics study free of coast with ads free platform and also no need to sign in just install and start studying also includes hundreds of languages and many other subjects with 6500 free video lectures"
  },
  {
    "rating": 5,
    "review": "Great app. However, the browser version is more robust. I use the mobile app as a supplement to the browser one."
  },
  {
    "rating": 1,
    "review": "I downloaded this to brush up on my math but it's impossible with the way they teach it. They make it so much more difficult than it needs to be. Instead of carrying numbers they have you do multiplication, division, grouping etc. It's just nonsense, I'm using the methods I learned and getting the answers before they do all of these extra unnecessary steps. Find another app if you can."
  },
  {
    "rating": 5,
    "review": "To whoever made this app, THANK YOU i looove learning random stuff and this app makes it so MUCH easier, i no longer have to spend hours looking for profesional papers honestly more ppl should get to know it (sry for typos, im more of a math, biology or paleonthology person so im not that good at grammar)"
  },
  {
    "rating": 5,
    "review": "This app is very good it enables you to study anything you want in high school and college Try it out"
  },
  {
    "rating": 1,
    "review": "i didn't like this app because since I download it there will be only 1. course they given to do . i think of some changes completely given to this app so can say something 😡😡🤬🤬🤬🤬"
  },
  {
    "rating": 5,
    "review": "By far the best app out there I found for learning no matter how old you are no matter how you learn the teachers have on their explanations everything is marvelous. I can't say enough about this app if you enjoy learning or you have to learn this is the app. And no I have no affiliation with this app in case you're wondering"
  },
  {
    "rating": 5,
    "review": "best ever, I have used this app for a very very long time now. First I used this app in middle school and it was fun to do problems, now I'm in college and still using this app to improve on the subject I don't understand. please never let this free app die keep it going. this is a very very helpful app if used properly. Thanks to the designer and thanks to the people who are behind all the hard work! keep up the good work. 🙏🙏🙏"
  },
  {
    "rating": 5,
    "review": "To the amazing team at Khan Academy, I am writing this to express my deepest gratitude for your incredible app and all the resources you provide. The impact you've had on my academic life is nothing short of life-changing. I started my high school career really struggling. I failed my 9th-grade exams and was given a compartment, and in 10th half yearly i failed than i got to know about Khan Academy, now I am thankful to you because I scored 95% thankyou very very much 🫂💓."
  },
  {
    "rating": 5,
    "review": "i think there should be a download method of video because sometime u have no package and low internet speed u can use download video for ur preparation"
  },
  {
    "rating": 5,
    "review": "It's my honest review after listening to the Limits and Continuity chapter of Class11 (Telangana Syllabus). It's Superb App and excellent explanation of basic concepts. Hats off to you guys for explaining in simple ways. And I appreciate Khan Academy for providing the concepts for free."
  },
  {
    "rating": 4,
    "review": "I dont know it is just my phone, but in the box grids 120, theres no numbers shown in the grids making it hard to know the missing number"
  },
  {
    "rating": 5,
    "review": "the app is full of lessons in different fields , even life lessons like hiw to apply for colleges and hows the experience etc. this app helped me learn different fields of math, how to use them, and tought me things missing from the national curriculum"
  },
  {
    "rating": 4,
    "review": "Khan I love ya to death man but you gotta put a restart button on each test. I know you want me to persevere when I get something wrong and all but I'm just 100% not gonna do that. I'm 25 man, I get it. The fact of the matter remains though that I'm not gonna accept a sub-par score and I'm not gonna redo the entire test after the fact purely for aesthetics so your move to try and promote perseverance is doing nothing but wasting my time since I'm not gonna capitulate regardless of any reason."
  },
  {
    "rating": 3,
    "review": "This app is great for anyone wanting to learn any topic, even those that are not necessarily academic. But I have a lot of issues with it; it's slow. Articles, exercises, and videos sometimes take way too long to load. There's even one exercise that I haven't finished because it won't load and all I see is a white screen. Also, some videos will all of a sudden lower their screen and sound quality. And it's not just for one video in a single unit."
  },
  {
    "rating": 5,
    "review": "simply amazing for learning and it is free totally. This has cut cost of buying books for tutoring my 6 years old son"
  },
  {
    "rating": 1,
    "review": "What is wrong with this app?? Now I'm just trying to see parent dashboard so I can give my son assignments & apparently I \"don't have permission to view the content\"??? What?? Please fix, this is very frustrating. Such a confusing app & its slowing my son's progress."
  },
  {
    "rating": 3,
    "review": "Khan Academy app is good for students and it helps in studies. In this app Urdu medium students, especially in Maharashtra, can’t read and learn properly because it is not available in Urdu. Please look after this and solve this problem so Urdu medium students can also benefit."
  },
  {
    "rating": 5,
    "review": "Why was I unsure while downloading it? Ughh... It is the best aide for a student. It has got curriculum for all."
  },
  {
    "rating": 5,
    "review": "been using since 2018, off and on. really useful as a disabled adult who wants to learn things but doesn't have the energy for rigorous schooling."
  },
  {
    "rating": 5,
    "review": "this is very good not just because it free but also because how Khan academy organize of matter per order, and I really like Khan Academy for the video learning.."
  },
  {
    "rating": 4,
    "review": "Khan academy is great, the lessons are amazing and coverage is good but it has a problem of constantly lagging, even in a brand new phone and great internet. otherwise I have no complaints."
  },
  {
    "rating": 1,
    "review": "I downloaded this app just so I can review the website. The website is awful because they don't write the questions and solutions in a way that autistic people can also understand. We use it at my college for math classes and every khan academy assignment just leaves me crying, frustrated, and feeling stupid because they can't be bothered to write the questions for everyone to understand. I can't imagine the app is any better."
  },
  {
    "rating": 1,
    "review": "there is no username to show and in this site lessons are not in order there was abig confusion of that one and if want to rate or other I go to browser I hate this and not a good quiz"
  },
  {
    "rating": 5,
    "review": "hi , I am momina . In my opinion this is the best app for study, specially for maths.from this app I got A+ in maths (o levels). thankyou for your support"
  },
  {
    "rating": 4,
    "review": "Khan Academy is a great resource for free education with well-organized content and easy-to-understand videos. The adaptive learning system is helpful, but there's room for improvement. More advanced topics and personalized learning paths would enhance the experience. Interactive exercises and stronger community features could also boost engagement. The mobile app could be optimized further. Regular content updates are needed, especially in fast-changing fields. Despite these areas, Khan Academy"
  },
  {
    "rating": 1,
    "review": "My experience was bad 😔....as I founded many questions wrong in the quiz and there's only one chance to answer a question in quiz which makes my child very disappointed and now she have made her maths bad....not recommended app from me...the teachers in videos have no excitement towards teacher....can be better..."
  },
  {
    "rating": 3,
    "review": "I'm going to give three stars fr two reasons, one there isn't an option for question grammar, or wording. And two because it goes from giving examples about bits and bites \"in sequences\" and when it asks you \"how many different values can four bits represent\" but the explanation in the answer states \"a sequence of four bits can represent The following distinct values\" these are two different things no? and yea I'm a little slow but trying to learn computing while also fighting grammar isnt fun"
  },
  {
    "rating": 3,
    "review": "this made my exam go so much easier but it took me lot of time to complete a whole NCERT Chapter. Is this app considerate of your time? Not Always."
  },
  {
    "rating": 1,
    "review": "I have been using the website for a while now and then I downloaded the app I use it for SAT and it was working pretty good but now I m facing an issue that it's asking to select my course ( which I had but now it's asking me again)and in the courses i couldn't find SAT READING AND WRITTING AND MATHS I have tried everything but it's isn't working please resolve my issue"
  },
  {
    "rating": 1,
    "review": "i am new here i have choosen math subject for class 9 they teach but not in.urdu they teach in english and i cant clear topicss"
  },
  {
    "rating": 1,
    "review": "it doesn't teach you anything what you already know it's not right for the kids you don't have a teacher"
  },
  {
    "rating": 1,
    "review": "Many bugs and takes forever to sign in plus it always says \"No\" internet even though I have a Wifi 6 router that runs 40-50 Mbps"
  },
  {
    "rating": 3,
    "review": "App need some improvements , dashboard appearance is good to see in web based but not good in mobile app, too difficult to use in mobile."
  },
  {
    "rating": 1,
    "review": "It's very good, my school use it as a way to learn in advance. But I just seem to struggle to use the app in mobile, the keyboard is very confusing. When the subject is Math, the keyboard is all numbers, no letters, so when the topic is Algebra, there's no letters for me to use as a variable, means I can't complete the answer. Which lead to me getting wrong answers. I think I'm the only one with this problem, if I am the only one, at least can someone tell me how to fix it. Thank you."
  },
  {
    "rating": 1,
    "review": "stole my daughter's information and got her Gmail password and logged us out of her Gmail terrible app"
  },
  {
    "rating": 4,
    "review": "I remove one star due to the company's marketing towards donations. Khan Academy website is amazing for how available it is to students despite their background. While the company has large profits from donors, their ad makes it look like they're struggling to make ends meet. I would like to make small occasional donations of the amount I decide, but they put either 12$ per month minimum or 55$ once, which is just greed. Some courses need updating too, yet they don't bother with user feedback."
  },
  {
    "rating": 1,
    "review": "I can't sign up I have been waiting and sitting for it to be done and nothing happen like it's a forever screen I can't sign up pls fix it I need it for my school;("
  },
  {
    "rating": 3,
    "review": "it's not so bad I just wish it was more clear and engaging it's boring no fun in learning but. still overall not an bad app"
  },
  {
    "rating": 1,
    "review": "the content is amazing, but the app itself feels like it was just thrown together. it’s clunky to navigate, half the time it feels like you’re just using a stripped down version of the website, the layout looks outdated. it doesn’t feel like a proper mobile app at all, just something they slapped on the store."
  },
  {
    "rating": 4,
    "review": "Absolutely no ads, no premium plans, a simple interface and free educational lessons!! I've been using it almost my entire summer break, and it's a great way to learn something new or re-do past school lessons that I missed out on or want to revise. I can't wait to complete even more lessons in this app. Finally, the teachers there explain things throughoutly. Absolutely no complains. Only that it fails to load at start-up sometimes, however, that could be a server's issue."
  },
  {
    "rating": 4,
    "review": "The app quite literally wouldn't get downloaded (I downloaded other apps to see if the problem is specific with this app, and it was) I sent a report for google now, but I hope that whatever issue gets resolved Edit: The app finally downloaded. I think the problem was with the playstore itself, but I don't know why this particular app wouldn't be installed."
  },
  {
    "rating": 4,
    "review": "very nice app. doesn't has any ads and free. the only problem I face is that I don't get the right course. there are many little courses that I find on time. I hope this issue would be solved."
  },
  {
    "rating": 2,
    "review": "getting better but signup problem.its is made based on all well scopic extra topics as well as course lessons"
  },
  {
    "rating": 4,
    "review": "Good app but add more diversity in math and stuff, i cant seem to find the english courses for some math topics ngl and also 9-12th grade stuff"
  },
  {
    "rating": 4,
    "review": "what drives me crazy is the app not allowing restart of a test. believe me if I want to restart it \"keep going\" is not going to make me finish it it will just waste my time with skip yes I want to skip until I'm finally allowed to restart."
  },
  {
    "rating": 1,
    "review": "it keeps on signing out and won't sign in whatsoever. the loading screen either takes so long or actually never loads in. And sometimes, after doing an activity, it still says that I haven't done it."
  },
  {
    "rating": 2,
    "review": "Khan Academy is good and all, but it seems to work just as well on Google. I don't recommend having to get the app as it is very unnecessary."
  },
  {
    "rating": 3,
    "review": "the website is much better, I've been using khan on the web for probably over 7 years now and now that I've downloaded the app I've got to say, the app is pretty disappointing. you have to tap (very aggressively) your answer at least 2 or 3 times before it actually enters in, and for multiple choice you have to tap at least 2 of the choices before it will give you the submit button. kind of really frustrating. there also doesn't seem to be the same amount of courses as there are on the web."
  },
  {
    "rating": 3,
    "review": "It gets the job done, no more, no less. There are also some bugs here and there but they're not much of an inconvenience."
  },
  {
    "rating": 4,
    "review": "the app is full of courses, and I love it. My only issue is on tests it lags sometimes, and I accidentally click check on the next question before putting in an answer."
  },
  {
    "rating": 3,
    "review": "It is slow to open and always requires data to open even though the offline downloads are there for a reason. The app also doesn't let me click on the progress report option and many more. Great teaching though but it needs an upgrade"
  },
  {
    "rating": 4,
    "review": "this app is great if you want to learn mostly everything from math to AI to science. The only problem is that there are too few questions, but I might be incorrect."
  },
  {
    "rating": 4,
    "review": "awesome. I can track my progress with the skill points system. The lessons are well detailed too. What impressed me just now was the scratch board included, which could come in handy in case I left my pen at home⭐⭐⭐⭐⭐👍. The annoying part though is how long it freezes during loading at the home page. Wish you could do something about that. Edit: I removed a star cuz an exercise had a wrongly expressed answer."
  },
  {
    "rating": 3,
    "review": "I have a very difficult time getting back to where I left off. there's no magic button in the home menu that says return where you left off. if I can't find the way back I'm going to try a more user friendly program. I very much enjoy the teachings."
  },
  {
    "rating": 3,
    "review": "I love this app but recently the issues started to show. Sometimes it skips a lesson and I get so confused how I got jumped into some two lessons ahead. If you're clicking next, it should go to the next one instead of jumping ahead. I have to go back and redo the lessons. The app is laggy, I don't want the videos to auto play. I want to click play on my own after I choose full screen."
  },
  {
    "rating": 4,
    "review": "The app needs A LOT of work, but their web and concept is the best ever, appreciate them really much, kudos 👏🏿"
  },
  {
    "rating": 3,
    "review": "its kind of good but whenever I click on a button in a course or any feature it does nothing so I must do it on bing and it's kind of long to do that. Please fix this."
  },
  {
    "rating": 4,
    "review": "It's like really good, I like the quizzes and all but the biggest PROBLEM is that whenever I click start over, a msg pops up \"DON'T GIVE UP YET\" something like this and its so annoying cuz I'm not giving up I'm doing it again cuz I saw the answer and now it won't give me the points!!!"
  },
  {
    "rating": 2,
    "review": "I am science student from Bangladesh. I wanted to use it for studying science subjects. But they don't provide it in bangla language and it is difficult for me understand in english. So providing them in bangla will be very helpful and other things are pretty good"
  },
  {
    "rating": 3,
    "review": "would give it a five-star if I could just not have to watch the videos. the videos just don't do it, there needs to be options on if you can watch the videos or be able to do everything by reading."
  },
  {
    "rating": 2,
    "review": "this app is good but not easy to use and it's us very struck and it is very difficult to use it is not good at all if we want to study subject English it's not showing English we want to study for class 7th it is not showing for the class 7th it was showing it was showing that chemistry biology Earth physics I will give review I will give only two stars to this at the khaad academy is not good thought please don't use this academy it is good but we got able to use this and it is very bad 😞 sry"
  },
  {
    "rating": 2,
    "review": "you can download some content for offline but can't for others. I wanted my child to use it without it being connected to wifi. this feature is useless."
  },
  {
    "rating": 2,
    "review": "There's a performance issue whenever opening the app. I cannot click on anything until about 2 minutes has passed, when all clicks happen at once. Another problem is that it doesn't hold my progress when closing the app. I hoped to use this to revise on the train but I have to switch app to show my train ticket, then my progress is gone and the 2 minutes delay is back!"
  },
  {
    "rating": 3,
    "review": "Ive been using this app for about a year and ever since this last update I havn't been able to load a question which is really annoying because I want to learn the math and now im at a setbqck because of this. If fixed ill change my rating."
  },
  {
    "rating": 3,
    "review": "the subjects aren't organized very well based on difficulty, making it extra hard to work out where to go next"
  },
  {
    "rating": 2,
    "review": "I stopped trusting in Khan academy when I had done one of their intro coding lessons and the instructions said to make food on a plate. I made a carrot and some cauliflower. Then proceeded to get a low score because they said my broccoli needed to be green. Can't trust a school that doesn't know that cauliflower exists."
  },
  {
    "rating": 2,
    "review": "An insane experience for free. I wanted to go back to school but I knew I'd be placed in lower level math, adding years to any degree program. Khan academy is giving me tons of confidence with a very clear path forward to learning much of the math I forgot from school. An excellent tool for learning. Edit: after a month of use dropping to a two because the keypad constant enters random inputs requiring constant attention and navigating a coordinate grid with shapes is torturous"
  },
  {
    "rating": 2,
    "review": "really good application with quality content and a really bad user interface. I wish there was a way to go back to the home page from anywhere in the app and follow my progression from the home screen. there is a way to see your current topic from the home page but only to the current \"big topic.\" I wish there was a way to see a more detailed overview of where I am and what subjects exactly I'm progressing in"
  },
  {
    "rating": 2,
    "review": "been trying to open a content like taking a course challenge or opening a lesson but it sends me to a blank page is your app glitchy now please?"
  },
  {
    "rating": 2,
    "review": "I'm not brave enough to rate a star, I appreciate the content in the App. the matter is that when I want to switch to my mobile phone, downloaded this app entering... had to wait over 2minutes just for loading content everytime, content loaded up, cilcked on a content, Had to wait a 10sec. I'm very frustrated. it teasting my patience and ruining the mood. good looking UI tho, but poorly UX. is my phone that poor? can't even run this learning app or is the App terrible itself?"
  },
  {
    "rating": 2,
    "review": "Everytime I answer a question , It says that I'M wrong then when I go and check the answer , It says exactly what I answered."
  },
  {
    "rating": 2,
    "review": "Nowhere near the app you used to be! So much you let them tell you to delete and you did! Viable true information that helped we the people who really make or break you, there are way more of us little people."
  },
  {
    "rating": 2,
    "review": "The overall is good but there not Hinglish as in india many students wants to learn in the language of Hindi+ english as well"
  },
  {
    "rating": 2,
    "review": "I would have given a five star, but I'm not impressed with the way the app misbehaves and it's like the app always have to boot for any command given. I mean the app is very good and it's highly recommend for freshers and the proficient individuals in any particular area os study, but the app is always misbehaving by not responding frequently."
  }
]