[
  {
    "rating": 5,
    "review": "G- Helpians ( LD Gurnani Sir, Suratgarh, Ganganagar, Rajasthan, India) 🥰😍🤩🤎 Fantastic app , I loved it 😀 and everyone must have it"
  },
  {
    "rating": 1,
    "review": "2025 this app only for play (1) need to access website to create quizzes (*) verdict delete account and uninstall for good"
  },
  {
    "rating": 5,
    "review": "OMG, my students enjoy using Quizziz or Wayground for many years now! There's function for schools without devices and that's the case for most schools in Malaysia. Thank you so much from the bottom of my heart. As a passionate educator, you have made my teaching journey more meaningful and fun!"
  },
  {
    "rating": 4,
    "review": "I usually like quizizz. But when I use it in school, it doesn't work sometime.The app isn't installing when it allows to install.But this app provides many educational information and make our brain grow."
  },
  {
    "rating": 2,
    "review": "mấy chức năng điều tốt nhưng cái con al của phần tạo bài học tập á cần đc cải thiện vì chụp câu hỏi như vậy nhưng nó ra không đúng vì thế cần đc cải thiện ngay"
  },
  {
    "rating": 5,
    "review": "LOOOOOOOOVE IIIIIT as it help my student to answer properly as it show them which is wrong and correct"
  },
  {
    "rating": 2,
    "review": "It's good for revising for upcoming exams but the most annoying, sometimes when I want to do a quiz it tell me ThErE iS aN eRrOr pLeAsE tRy AgAiN and they write under it go to homepage when go there nothing happens anddd when I finish a quiz sometimes it tell me ThErE WaS a TiMeOuT iSsUe like I want to see my results"
  },
  {
    "rating": 4,
    "review": "I like it but whenever I set my last name to something it would always be \"[name] L\" and not \"[Name] Lol\" 💔"
  },
  {
    "rating": 3,
    "review": "I like it but for Malaysian it's hard for us to find quizzes for each subjects chapter by chapter and some good quizzes hope they can add more or something idk"
  },
  {
    "rating": 5,
    "review": "Been using this app with my students since long time ago.. Fun, interactive and engaging for synchronous or asynchronous class..."
  },
  {
    "rating": 5,
    "review": "Great app to create group quizzes and have fun competing against each other. Very user friendly and great even with larger groups"
  },
  {
    "rating": 1,
    "review": "please improvise the app not give in gaming mode it not good to use please give download option in the app need to improvise the app gaming model app not good."
  },
  {
    "rating": 5,
    "review": "highly recommend 👌 I Use it for my school this app is very friendly and easy to use by the design. I think it has more good interior kindly work on this app looks plz pretty 😍 💯"
  },
  {
    "rating": 1,
    "review": "WORST. I CAN'T ACCESS THE PAPER MODE. ALL IT SAYS IS \"EXPIRED QR CODE\" EVEN THOUGH I JUST STARTED THE QUIZ. DISAPPOINTING. I NEED THE OLD QUIZZIZ"
  },
  {
    "rating": 4,
    "review": "it is the best quiz platform for children but it doesn't contains much quizzes of Hindi and Sanskrit."
  },
  {
    "rating": 1,
    "review": "well guess what? IM ALREADY LOGGED IN AND WHEN I JOIN A QUIZ IT TELLS ME TO LOG IN AGAIN AND \"Oh YoUr BrOwSeR iS uNsUpPoRtEd\" and when i try using a different browser? BAM it takes me tocthe same damn unsupported page, i hate this app"
  },
  {
    "rating": 5,
    "review": "I love how interactive it is. I hope that there will an interactive offline mode as well in the future."
  },
  {
    "rating": 1,
    "review": "I used to like this app back when you didn't have to pay to make more than 20 quizzes on one account. My school isn't affiliated, and I'm just a student who can not afford yet another monthly subscription. It's truly disappointing to see this \"educational\" platform become a predatory cash grab. I didn't even mind that some features were blocked behind a pay wall, but putting behind a pay wall half the function people use this for? Simply ridiculous. And btw, the new name sucks."
  },
  {
    "rating": 5,
    "review": "this app really helps alot i was absent during my english final exam, and I didn't do it with the rest of my class, and hearing what happened on the exam day made me believe that I was definitely going to fail until I found this app, I studied for only 1 hour the night before of the exam using this app and I literally solved my exam as if am solving first grade English exam"
  },
  {
    "rating": 5,
    "review": "wow this app is really made for me I am weak in maths I think this will help me grow up my maths. I love it"
  },
  {
    "rating": 4,
    "review": "I liked it a lot. It's very user friendly and it allow students to work individually instead of waiting for others like kahoot, so I can use it as an exit ticket. The only thing I don't like is that now we have a limit on how many activities we can create and then we need to upgrade."
  },
  {
    "rating": 5,
    "review": "it's easy to use and as far as I know doesn't really have any ads that disturb the learning process(I think, idk tbh). I've loved quizziz since long ago and it really helps me to use the app form rather than the website. a bit odd that they changed the name but the rebranding of the format looks prettyyy cool. I like it alot and recommend to anybody to use to study and help make quizzes for others as well. 10/10"
  },
  {
    "rating": 4,
    "review": "I'm using this app for flashcards and test myself. I can use image and voice for free too! Quizlet flashcard is have to paid for images and voices."
  },
  {
    "rating": 1,
    "review": "i hate it it doesnt let me put my username my teacher said to put my realll name,guess what it doesnt WORK"
  },
  {
    "rating": 5,
    "review": "This application is very good for students to study. I like this app very much but the main problem is the application can only be used when there's internet connection."
  },
  {
    "rating": 2,
    "review": "I have had nothing but, problems with both the app & website sense the change. I've used this platform for a few years now both for personal studying & teaching. The App refuses to use anything AI related. Like for example, It shows questions it wants to add to a quiz but, refuses to add them. I use this platform mainly because it saves me time, on making quizes, flashcards by using the Al generation using a document. However, this is where the problem is. Please fix."
  },
  {
    "rating": 5,
    "review": "better than Kahoot! more options that make it more user friendly! used it for an office quiz.. had 18 participants... it was a breeze!! the reports were convenient too."
  },
  {
    "rating": 1,
    "review": "cannot join game as student. even though i already in student mode. have to uninstall it first and reinstall it everytime when to join a game!! what waste of time!!"
  },
  {
    "rating": 5,
    "review": "It's a wonderful app to conduct a quiz for the students. Also we can take any quiz we want to improve our knowledge"
  },
  {
    "rating": 5,
    "review": "waktu itu ada LCC di sekolah 2 hari berturut-turut aku latihan di Quizizz Alhamdulillah lolos babak penyisihan. recommended deh nih aplikasi buat yang mau ujian atau pun untuk belajar 🥳💘 edit : TAPI NGE LAG MULU MANA LOG OUT TERUSS"
  },
  {
    "rating": 1,
    "review": "It is so sad that this app turned the quick route to AI enhancement for everything, I liked this app because it was normal, common people who made each quiz with dedication to teaching about things like medical terminologies to the ABC's, now everything is copy of Chat GPT, AI is dangerous in the hands of wrong people."
  },
  {
    "rating": 3,
    "review": "Honestly this app is Fine on it's own i Love it but the App was A Bit Slow/Laggy so i do hope this gets patched soon and it almost made my Phone UI System Crashed... Please consider patching this."
  },
  {
    "rating": 4,
    "review": "wayground is great and all, but the thing I dislike about it is every time I finish a task its unable to let me in on another task unless I uninstall and install it again. please do something about this."
  },
  {
    "rating": 5,
    "review": "good but i cant go live with my tablet. what is wrong with live feature. please fix it. thank you, Dev!"
  },
  {
    "rating": 4,
    "review": "amazing and fun 🙂. but Im sometimes offline while using the app. and I can't change my name. by ur gr5 student 🙂🙂"
  },
  {
    "rating": 3,
    "review": "it's a great app to use the only issue comes in when I am trying to share a practice link with my classmates which it seems they fail to access. the link doesn't work 😔"
  },
  {
    "rating": 1,
    "review": "When I answer a quiz, I'm always asked to log in/sign in even though I already have an account, and sometimes the assigned tasks disappear. Ayuson nindo yan tadtadon ko kamong 1 star 😤"
  },
  {
    "rating": 1,
    "review": "always asking for money like a beggar I have created more than 20 quizzes before it changed its rules that non premium users cannot do so. Without knowing this, I wasted my whole morning to create a quiz. Out of the blue, it stated I cannot do so because I'm not rich enough. pls, most users are students. And this app is created for education purposes. I understand that u can make some functions to be only available for premium users, but what is the point to compel old users to pay?"
  },
  {
    "rating": 2,
    "review": "the apps itself is great helps me a lot, but since the recent update they lots of bugs and lag. although my internet status is excellent the time taken for the answer shows quite long . it's always says internet error or something. please fix this"
  },
  {
    "rating": 1,
    "review": "It was an amazing app, atleast it used to be. Everything is so slow, crashes frequently, plus the name doesnt even connect."
  },
  {
    "rating": 3,
    "review": "Hey i want to informatize the application mobile is buggin, i can't use my skills when answering the question causing im lower grade than my friend who using web applications. Pls fix it quickly."
  },
  {
    "rating": 1,
    "review": "For now, I'm giving this 1 star. It's because I just made a quiz (max of 32 questions) and i lost it, i spent hours on that and when i turned to try it out I think I accidentally assigned it to a random person, then my account switched to a diff language, and then i lost it. I'm just so pissed about it (MOCK LONG QUIZ-MIL is the name btw)🙃"
  },
  {
    "rating": 3,
    "review": "This is an Amazing App it helps me a lot, you just need to search the specific title of the lesson and boom enjoy the quiz nice. Edit: I can't open when I play now, pls Fix this it's just say Connecting indefinitely"
  },
  {
    "rating": 4,
    "review": "Why is there no flashcards on the app?🤧 Mas better pa tuloy yung site kasi may flashcards. But anyways, it was a great app👍 Very helpful."
  },
  {
    "rating": 1,
    "review": "desktop issues can't use my collection on my pc because it shows collection is empty. Definitely not worth paying for a membership"
  },
  {
    "rating": 1,
    "review": "couldn't let me login to the quizizz even though I had already login to the quizizz app, when I put my email it just say \"couldn't sign you in\" pls fix this."
  },
  {
    "rating": 1,
    "review": "I cannot participate in the quiz; it says I need to sign up or log in, even though I am already logged in."
  },
  {
    "rating": 4,
    "review": "so nice helpful and excellent in my opinion u should try it helped in my final exams alot for practicing my lessons thanks sooooo much for who created it 😃"
  },
  {
    "rating": 2,
    "review": "Overall it is good but sometimes it is showing a wrong answer as the correct answer. Accuracy is not there in the questions as the answers showing is irrelevant"
  },
  {
    "rating": 4,
    "review": "It's really exciting because if there's a test or exam, you can test it first on the Quizziz platform🤩"
  },
  {
    "rating": 2,
    "review": "sometimes when answering, it doesn't allow me to pick an option (glitched) and I had to exit and play again. This also might cause a loss of points while playing. Hopefully this can be fixed asap."
  },
  {
    "rating": 3,
    "review": "I am already Logged in with my ID, In a day Quizizz app work smoothly and directly start quizz 1st time, but while I am attending 2nd quizz then your app asking login but I am already Logged in and also in app show I am logged in. So I will use that movement chrome browser."
  },
  {
    "rating": 2,
    "review": "I like quizzizz, but it is just too laggy on mobile and it crashes almost always durning games. please fix"
  },
  {
    "rating": 4,
    "review": "my students enjoy appearing quizizz as a tool to evaluate their learning. more quizzes should be permitted in free account"
  },
  {
    "rating": 4,
    "review": "Almost Perfect. But could you allow us to play the mastery peak game in landscape mode? It would be nice if we could project the actual player mode in smart TV. Then is there a way the host could also play the game while hosting the game simultaneously in mastery peak mode? That would be nice. But all in all, this is the only platform so far where we could use fill in the blank. Its important specially in math to avoid guessing correct answer. If only i could landscape so it is larger"
  },
  {
    "rating": 4,
    "review": "This application is useful for intellectual progress, being a student, it helps me to see good grades while having fun, and frankly I think it should increase in popularity. So why not 5 stars,honestly it is VERY difficult to find the right button to do the quiz it took me time to understand that it was the \"preview\" button, otherwise it is almost impossible to find another player to play with..."
  },
  {
    "rating": 4,
    "review": "Yaxshi ilova lekin mening qurilmamda bu ilova 20ta savoldan keyin qotib qolyapti. Davom etish uchun ilovaga qayta kirishga toʻgʻri kelyapdi"
  },
  {
    "rating": 3,
    "review": "lagging too often. this app is a bit different with web version. i want it to be similirar in system and function"
  },
  {
    "rating": 4,
    "review": "Its great and good option if you have exams but like can someone help me on how to change my qbit(?) Avatar? Im on mobile and i cant find it in the settings??"
  },
  {
    "rating": 3,
    "review": "I love using Quizizz but there is a lag that deletes my answers and it gets quite frustrating. Everything else seems fine. I will continue to use it."
  },
  {
    "rating": 2,
    "review": "Made a quiz but I can't even publish it I can't even find the assign or host button please fix it on phone"
  },
  {
    "rating": 3,
    "review": "This might be the best app to help a students like me to study for the upcoming tests, quizzes, and exam. But in my experience, whenever I started making a quiz and when i come back, it just mix up whenever i arrange them in order when i come back it would be mix up. Second is that when i try to add some questions, it would just say error when i try to save the question even though the internet is good. But its really great though."
  },
  {
    "rating": 2,
    "review": "Since the android update (I think), I can't use paper mode. The option to scan hasn't shown up. Please fix! Other than that I love quizziz. Update: the update came out last night. Will try today."
  },
  {
    "rating": 3,
    "review": "यह ऐप मैं अभी तक उसे नहीं किया U oh ttgyyxkjffyf ke uffu to h koni rajasthan ke kro gussa a gaya hai ke aaj kal ki bat 🦇 h to so jao man tumhen pyar kam kru fer rat men han to koni lag rahi hai to use apane ghar men taiyar vastvik rup men taiyar kishori ke parijanon ke prati jagaruk karna to dur ki ki vah apane ghar ja to the road and rail station 🚉 to the sara din me tin din men taiyar kishori ke sath baat hai ke liye lehnga ke sath me tu hi bata sakte to yahan click kare ke chahi lekin ab y"
  },
  {
    "rating": 2,
    "review": "I enjoy the app in class however when i answer there's is a significant input delay which give me a wrong answer and failed my class"
  },
  {
    "rating": 2,
    "review": "Great app but I prefer not the best they are very easy question and not for a test or studying person but great for a person who wants to solve exercise and he is already an expert"
  },
  {
    "rating": 2,
    "review": "I like it but not much because when you need it at school it's like check your internet connection bro I already did that 🙄 that thing needs too much internet"
  },
  {
    "rating": 2,
    "review": "there's a frustrating bug in the app. every time I creat a multiple choice quizz and try to add something in \"add options\" gets vanished. I need to retype my options multiple times to get it saved. until this bug is resolved this app deserves 5 stars."
  },
  {
    "rating": 3,
    "review": "I don't like how halfway into a quiz competition the app would stop recording the answers and all of a sudden it starts saying \"trying to reconnect, click to retry\" its annoying even with good network connection or interrupting me with unable to save answers...."
  },
  {
    "rating": 3,
    "review": "Where is the latest version in app? you only provide latest version of dino in web. We need the latest version in app."
  },
  {
    "rating": 2,
    "review": "susah banget mau bikin quiz di hp. kadang kadang ngga muncul hurufnya, kadang kadang muncul dobel, kadang kadang yang muncul cuman 1 huruf. mana gitu mau mindahin kursor juga gabisa, jadi kalo salah nya diawal harus hapus semuanya. mana ngehapusnya susaah banget lagi. sebelum di fix gabakal bisa bikin quiz di hp."
  },
  {
    "rating": 3,
    "review": "Olá, gostaria de reclamar de um problema com o aplicativo. Tenho ele instalado no meu celular somente para uso pedagógico e o problema é que as vezes os aplicativo não abre, é algo grave; como uso para escola isso pode afetar não somente o próprio aplicativo em si mas também como meu desempenho escolar. Gostaria que arrumassem isso, é algo que acontece com frequência."
  },
  {
    "rating": 3,
    "review": "I like the paper mode option which is really effective but I can't reconnect it once the connection is lost. This paper mode feature is a game changer but it has reconnecting issues, when I try to resume the scan mode, it simply doesn't allow me to and sends me back to the explore page which is really annoying. Please try to resolve this issue. Otherwise it would be a really good quizzing app."
  },
  {
    "rating": 2,
    "review": "I really like this but some or few of the questions are correct which the option I choose but the app is showing incorrect and I don't know why I even googled to see it and I was right."
  },
  {
    "rating": 3,
    "review": "MY APP HAS THE PROBLEM: Oops! Something went wrong while generating the quiz. Something went wrong while extracting content!"
  }
]